tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "mykolaharmash/git-jump"
tap "wez/wezterm"
tap "yt-dlp/taps"
brew "autojump"
brew "awscli"
brew "bat"
brew "chezmoi"
brew "gnutls"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "gnupg"
brew "go"
brew "haskell-stack"
brew "jq"
brew "nasm"
brew "neovim"
brew "nvm"
brew "pinentry-mac"
brew "postgresql@14"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "serve"
brew "telnet"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman"
brew "yarn"
brew "zsh-autosuggestions"
brew "mykolaharmash/git-jump/git-jump"
brew "yt-dlp/taps/yt-dlp"
cask "1password-cli"
cask "appcleaner"
cask "dbeaver-community"
cask "figma"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "netnewswire"
cask "ngrok"
cask "notion"
cask "numi"
cask "postman"
cask "raycast"
cask "slack"
cask "ticktick"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zotero"
