# Simple, modern, secure file encryption
brew "age"
# Command-line interface for SQLite
brew "sqlite"
# Browser automation CLI for AI agents
brew "agent-browser"
# Plugin manager for zsh, inspired by antigen and antibody
brew "antidote"
# Record and share terminal sessions
brew "asciinema"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Tool for exploring each layer in a docker image
# brew "dive"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# Git blame for file trees
brew "git-who"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Much more powerful alternative to kubectx and kubens
brew "kubie"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Deep clean and optimize your Mac
brew "mole"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Pre-commit re-implemented in Rust
brew "prek"
# Ruby version manager
brew "rbenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Rust toolchain installer
brew "rustup"
# Web search from the terminal
brew "s-search"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Cross-shell prompt for astronauts
brew "starship"
# Use SQL to instantly query your cloud services
brew "steampipe"
# TCP connect to the given IP/port combo
brew "tcping"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Tool for writing better scripts
brew "zx"
# Local-First Snippet Manager
brew "atobaum/tap/snipgo"
# Git branches helper: interactive UI and fuzzy-serach for Git branches
brew "mykolaharmash/git-jump/git-jump"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Time blocking and productivity platform
cask "akiflow"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Cross platform SQL editor and database management app
cask "beekeeper-studio"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Image, video and clipboard optimiser
cask "clop"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# API documentation browser and code snippet manager
cask "dash"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
cask "font-fontawesome"
cask "font-hack-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Tools to protect your files
cask "gpg-suite-no-mail"
# OpenPGP/GnuPG crypto, sign and key management tool
# cask "gpgfrontend"
# Desktop automation application
cask "hammerspoon"
# Dedicated scratchpad for developers
cask "heynote"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Software for Logitech devices
cask "logi-options+"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Code snippets manager for developers
cask "masscode"
# Korean e-book store
cask "millie"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Document editor
cask "onlyoffice"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Calculate the overall performance of an investment portfolio
cask "portfolioperformance"
# Control your tools with a few keystrokes
cask "raycast"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF reader and note-taking application
cask "skim"
# Local-First Snippet Manager
cask "atobaum/tap/snipgo-gui"
# Text editor for code, markup and prose
cask "sublime-text"
# Real time file synchronisation software
cask "syncthing-app"
# Lightweight CSV editor
cask "tablecruncher"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-app"
# Multiplayer code editor
cask "zed"
# Open-source markdown editor
cask "zettlr"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "cweijan.onedark-modern"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "esbenp.prettier-vscode"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "maattdd.gitless"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-vscode.makefile-tools"
vscode "myriad-dreamin.tinymist"
vscode "openai.chatgpt"
vscode "patrickt.hledger-lsp-vscode"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
go "github.com/natesales/q"
uv "claude-monitor"
