tap "aws/tap"
tap "knqyf263/pet"
tap "mykolaharmash/git-jump"
tap "navercloudplatform/tap"
brew "giflib"
brew "libpng"
brew "xz"
brew "argo"
brew "argocd"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "asciinema"
brew "asdf"
brew "awscli"
brew "bat"
brew "binutils"
brew "btop"
brew "caddy"
brew "gettext"
brew "cairo"
brew "chezmoi"
brew "cilium-cli"
brew "cloudflared"
brew "direnv"
brew "enscript"
brew "eza"
brew "fava"
brew "fd"
brew "pango"
brew "zeromq"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-absorb"
brew "git-delta"
brew "git-lfs"
brew "git-trim"
brew "git-who"
brew "gnu-sed"
brew "pinentry"
brew "gnupg"
brew "go"
brew "golangci-lint"
brew "librsvg"
brew "graphviz"
brew "gron"
brew "haskell-stack"
brew "helm"
brew "helm-docs"
brew "helmfile"
brew "hledger"
brew "htop"
brew "httpstat"
brew "istioctl"
brew "jabba"
brew "jnv"
brew "jpeg"
brew "jq"
brew "just"
brew "trufflehog"
brew "k3d"
brew "k6"
brew "k9s"
brew "kanata"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubectx"
brew "lazydocker"
brew "lazygit"
brew "libpq"
brew "minikube"
brew "mongocli"
brew "mongosh"
brew "moreutils"
brew "zlib"
brew "mysql-client"
brew "neovim"
brew "nmap"
brew "openblas"
brew "pandoc"
brew "pinentry-mac"
brew "pipx"
brew "pkgconf"
brew "postgresql@17"
brew "pyenv"
brew "pyenv-virtualenv"
brew "qemu"
brew "redis"
brew "rename"
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "sshpass"
brew "starship"
brew "steampipe"
brew "stern"
brew "tcl-tk"
brew "tcping"
brew "telnet"
brew "terraform-docs"
brew "terragrunt"
brew "testssl"
brew "tfenv"
brew "tflint"
brew "thefuck"
brew "tlrc"
brew "tree"
brew "trivy"
brew "uv"
brew "vercel-cli"
brew "wasmtime"
brew "watch"
brew "web-ext"
brew "wget"
brew "yarn"
brew "yazi"
brew "you-get"
brew "yq"
brew "yt-dlp"
brew "zellij"
brew "zoxide"
brew "zsh"
brew "zx"
brew "aws/tap/ec2-spot-interrupter"
brew "aws/tap/eks-node-viewer"
brew "knqyf263/pet/pet"
brew "mykolaharmash/git-jump/git-jump"
brew "navercloudplatform/tap/ncp-iam-authenticator"
cask "1password"
cask "1password-cli"
cask "adobe-acrobat-reader"
cask "anki"
cask "anytype"
cask "appcleaner"
cask "bleunlock"
cask "bruno"
cask "chatgpt"
cask "choosy"
cask "clop"
cask "cloudflare-warp"
cask "cursor"
cask "dash"
cask "datagrip"
cask "dbeaver-community"
cask "discord"
cask "firefox"
cask "firefox@developer-edition"
cask "font-hack-nerd-font"
cask "gather"
cask "git-credential-manager"
cask "gns3"
cask "hammerspoon"
cask "heynote"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keka"
cask "keybase"
cask "libreoffice"
cask "logi-options+"
cask "medibangpaintpro"
cask "mitmproxy"
cask "monitorcontrol"
cask "notion"
cask "notion-calendar"
cask "numi"
cask "obsidian"
cask "pritunl"
cask "raindropio"
cask "raycast"
cask "reader"
cask "session-manager-plugin"
cask "shottr"
cask "simple-web-server"
cask "sioyek"
cask "skim"
cask "slack"
cask "sublime-text"
cask "syncthing"
cask "todoist"
cask "via"
cask "visual-studio-code"
cask "wezterm"
cask "wireshark"
cask "zoom"
cask "zotero"
vscode "arcanis.vscode-zipfs"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "cweijan.onedark-modern"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-diff"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "jeff-hykin.better-dockerfile-syntax"
vscode "jock.svg"
vscode "kevinrose.vsc-python-indent"
vscode "mark-hansen.hledger-vscode"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "openai.chatgpt"
vscode "pjmiravalle.terraform-advanced-syntax-highlighting"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "run-at-scale.terraform-doc-snippets"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tim-koehler.helm-intellisense"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
