tap "atobaum/tap"
tap "aws/tap"
tap "mykolaharmash/git-jump"
tap "navercloudplatform/tap"
tap "yakitrak/yakitrak"
# Simple, modern, secure file encryption
brew "age"
# Record and share terminal sessions
brew "asciinema"
# Distributed revision control system
brew "git"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Library for command-line editing
brew "readline"
# Command-line interface for SQLite
brew "sqlite"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Securely store and access AWS credentials in development environments
brew "aws-vault"
# Official Amazon AWS command-line interface
brew "awscli"
# Curl like simplicity to access AWS resources
brew "awscurl"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Powerful, enterprise-ready, open source web server with automatic HTTPS
brew "caddy"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Load/unload environment variables based on $PWD
brew "direnv"
# Utility to configure multi-display resolutions and arrangements
brew "displayplacer"
# Tool for exploring each layer in a docker image
brew "dive"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# GNU Emacs text editor
brew "emacs"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Installer for the general purpose language Haskell
brew "ghcup"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Git extension for versioning large files
brew "git-lfs"
# Trim your git remote tracking branches that are merged or gone
brew "git-trim"
# Git blame for file trees
brew "git-who"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Passphrase entry dialog utilizing the Assuan protocol
brew "pinentry"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Manage your GnuPG keys with ease!
brew "gpg-tui"
# World's fastest and most advanced password recovery utility
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Create Helm chart from Kubernetes yaml
brew "helmify"
# Easy plain text accounting with command-line, terminal and web UIs
brew "hledger"
# Improved top (interactive process viewer)
brew "htop"
# Curl statistics made simple
brew "httpstat"
# Istio configuration command-line utility
brew "istioctl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Little helper to run CNCF's k3s in Docker
brew "k3d"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Sudoless performance monitoring for Apple Silicon processors
brew "macmon"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Deep clean and optimize your Mac
brew "mole"
# MongoDB CLI enables you to manage your MongoDB in the Cloud
brew "mongocli"
# MongoDB Shell to connect, configure, query, and work with your MongoDB database
brew "mongosh"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Fast, disk space efficient package manager
brew "pnpm"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Editor of encrypted files
brew "sops"
# Non-interactive SSH password auth
brew "sshpass"
# Cross-shell prompt for astronauts
brew "starship"
# Use SQL to instantly query your cloud services
brew "steampipe"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# TCP connect to the given IP/port combo
brew "tcping"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# User interface to the TELNET protocol
brew "telnet"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Tool which checks for the support of TLS/SSL ciphers and flaws
brew "testssl"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Linter for Terraform files
brew "tflint"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Find and verify credentials
brew "trufflehog"
# Markup-based typesetting system
brew "typst"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Dumb downloader that scrapes the web
brew "you-get"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# GTK+ dialog boxes for the command-line
brew "zenity"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Tool for writing better scripts
brew "zx"
# Local-First Snippet Manager
brew "atobaum/tap/snipgo"
# A simple CLI tool that triggers Amazon EC2 Spot Interruption Notifications and Rebalance Recommendations.
brew "aws/tap/ec2-spot-interrupter"
# eks-node-viewer is a tool for visualizing dynamic node usage within an EKS cluster.
brew "aws/tap/eks-node-viewer"
# Git branches helper: interactive UI and fuzzy-serach for Git branches
brew "mykolaharmash/git-jump/git-jump"
# NaverCloudPlatform Kubernetes Service Authenticator CLI for IAM Authentication
brew "navercloudplatform/tap/ncp-iam-authenticator"
brew "yakitrak/yakitrak/obsidian-cli"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Time blocking and productivity platform
cask "akiflow"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Open source IDE for exploring and testing APIs
cask "bruno"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Anthropic's official Claude AI desktop app
cask "claude"
# Image, video and clipboard optimiser
cask "clop"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# API documentation browser and code snippet manager
cask "dash"
# Databases and SQL IDE
cask "datagrip"
# Voice and text chat software
cask "discord"
# Desktop client for Ente Auth
cask "ente-auth"
# Web browser
cask "firefox"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-source-sans-3"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# GUI for the Dynamips Cisco router emulator
cask "gns3"
# Tools to protect your files
cask "gpg-suite-no-mail"
# OpenPGP/GnuPG crypto, sign and key management tool
cask "gpgfrontend"
# Desktop automation application
cask "hammerspoon"
# Dedicated scratchpad for developers
cask "heynote"
# Free and open-source media player
cask "iina"
# Keyboard customiser
cask "karabiner-elements"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Software for Logitech devices
cask "logi-options+"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Code snippets manager for developers
cask "masscode"
# Korean e-book store
cask "millie"
# Intercept, modify, replay, save HTTP/S traffic
cask "mitmproxy"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# App to write, plan, collaborate, and get organised
cask "notion"
# Calculator and converter application
cask "numi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama-app"
# Document editor
cask "onlyoffice"
# Utility to uninstall apps and remove leftover files from old/uninstalled apps
cask "pearcleaner"
# Calculate the overall performance of an investment portfolio
cask "portfolioperformance"
# All-in-one bookmark manager
cask "raindropio"
# Control your tools with a few keystrokes
cask "raycast"
# Save articles to read, highlight key content, and organise notes for review
cask "reader"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Screenshot measurement and annotation tool
cask "shottr"
# PDF viewer designed for reading research papers and technical books
cask "sioyek"
# PDF reader and note-taking application
cask "skim"
# Text editor for code, markup and prose
cask "sublime-text"
# Real time file synchronisation software
cask "syncthing-app"
# Lightweight CSV editor
cask "tablecruncher"
# Customizable email client
cask "thunderbird"
# Keyboard configurator
cask "via"
# Open-source code editor
cask "visual-studio-code"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "4ops.terraform"
vscode "anthropic.claude-code"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "austenc.tailwind-docs"
vscode "bradlc.vscode-tailwindcss"
vscode "cweijan.onedark-modern"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "ms-vscode.makefile-tools"
vscode "myriad-dreamin.tinymist"
vscode "openai.chatgpt"
vscode "patrickt.hledger-lsp-vscode"
vscode "pkief.material-icon-theme"
vscode "pomdtr.excalidraw-editor"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "timonwong.shellcheck"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "yzhang.markdown-all-in-one"
go "golang.org/dl/go1.23.3"
go "golang.org/x/tools/cmd/goimports"
go "golang.org/x/tools/gopls"
go "github.com/natesales/q"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/wailsapp/wails/v2/cmd/wails"
cargo "shimmy"
